# Lesson 38: Air Quality Analysis - Time Series Data

In [ ]:
# Import the required modules and load the time-series dataset on air quality. Also, display the first five rows.
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

csv_file = 'https://s3-student-datasets-bucket.whjr.online/whitehat-ds-datasets/air-quality/AirQualityUCI.csv'
df = pd.read_csv(csv_file, sep=';')
df.head()

         Date      Time CO(GT)  ...      AH  Unnamed: 15 Unnamed: 16
0  10/03/2004  18.00.00    2,6  ...  0,7578          NaN         NaN
1  10/03/2004  19.00.00      2  ...  0,7255          NaN         NaN
2  10/03/2004  20.00.00    2,2  ...  0,7502          NaN         NaN
3  10/03/2004  21.00.00    2,2  ...  0,7867          NaN         NaN
4  10/03/2004  22.00.00    1,6  ...  0,7888          NaN         NaN

[5 rows x 17 columns]

In [ ]:
# S1.2: Apply the 'info()' function on the 'df' DataFrame.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9471 entries, 0 to 9470
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   object
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   object
 3   PT08.S1(CO)    9357 non-null   float64
 4   NMHC(GT)       9357 non-null   float64
 5   C6H6(GT)       9357 non-null   object
 6   PT08.S2(NMHC)  9357 non-null   float64
 7   NOx(GT)        9357 non-null   float64
 8   PT08.S3(NOx)   9357 non-null   float64
 9   NO2(GT)        9357 non-null   float64
 10  PT08.S4(NO2)   9357 non-null   float64
 11  PT08.S5(O3)    9357 non-null   float64
 12  T              9357 non-null   object
 13  RH             9357 non-null   object
 14  AH             9357 non-null   object
 15  Unnamed: 15    0 non-null      float64
 16  Unnamed: 16    0 non-null      float64
dtypes: float64(10), object(7)
memory usage: 1.2+ MB

In [ ]:
#  Check for the missing values in the 'df' DataFrame.
df.isnull().sum()

Date              114
Time              114
CO(GT)            114
PT08.S1(CO)       114
NMHC(GT)          114
C6H6(GT)          114
PT08.S2(NMHC)     114
NOx(GT)           114
PT08.S3(NOx)      114
NO2(GT)           114
PT08.S4(NO2)      114
PT08.S5(O3)       114
T                 114
RH                114
AH                114
Unnamed: 15      9471
Unnamed: 16      9471
dtype: int64

In [ ]:
#  Drop the 'Unnamed: 15 and Unnamed: 16' columns from the 'df' DataFrame.
df = df.drop(columns=['Unnamed: 15', 'Unnamed: 16'], axis=1)

In [ ]:
#  Get the list of columns present in the 'df' DataFrame after removing the 'Unnamed: 15 and Unnamed: 16' columns.
df.columns

Index(['Date', 'Time', 'CO(GT)', 'PT08.S1(CO)', 'NMHC(GT)', 'C6H6(GT)',
       'PT08.S2(NMHC)', 'NOx(GT)', 'PT08.S3(NOx)', 'NO2(GT)', 'PT08.S4(NO2)',
       'PT08.S5(O3)', 'T', 'RH', 'AH'],
      dtype='object')

In [ ]:
#  Print the rows missing in the 'Date' column.
df[df['Date'].isnull() == True]

     Date Time CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)    T   RH   AH
9357  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9358  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9359  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9360  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9361  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
...   ...  ...    ...          ...  ...          ...  ...  ...  ...
9466  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9467  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9468  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9469  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9470  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN

[114 rows x 15 columns]

In [ ]:
#  Drop the rows containing at least one null value in the 'df' DataFrame using the 'dropna()' function.
df = df.dropna()

In [ ]:
#  Check whether all the missing values are removed or not.
df.isnull().sum()

Date             0
Time             0
CO(GT)           0
PT08.S1(CO)      0
NMHC(GT)         0
C6H6(GT)         0
PT08.S2(NMHC)    0
NOx(GT)          0
PT08.S3(NOx)     0
NO2(GT)          0
PT08.S4(NO2)     0
PT08.S5(O3)      0
T                0
RH               0
AH               0
dtype: int64

In [ ]:
# How many rows and columns are in the DataFrame after removing the rows and columns containing the missing values?
df.shape

(9357, 15)

In [ ]:
#  Print the last 5 rows of the 'df' DataFrame.
df.tail()

            Date      Time CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)     T    RH      AH
9352  04/04/2005  10.00.00    3,1       1314.0  ...       1729.0  21,9  29,3  0,7568
9353  04/04/2005  11.00.00    2,4       1163.0  ...       1269.0  24,3  23,7  0,7119
9354  04/04/2005  12.00.00    2,4       1142.0  ...       1092.0  26,9  18,3  0,6406
9355  04/04/2005  13.00.00    2,1       1003.0  ...        770.0  28,3  13,5  0,5139
9356  04/04/2005  14.00.00    2,2       1071.0  ...        816.0  28,5  13,1  0,5028

[5 rows x 15 columns]

---

In [ ]:
#  Concatenate the values stored in the 'Date' and 'Time' columns and store them into a new Pandas series.
dt_series = pd.Series(data = [item.split("/")[2] + "-" + item.split("/")[1] + "-" + item.split("/")[0] for item in df['Date']], index=df.index) + ' ' + pd.Series(data=[str(item).replace(".", ":") for item in df['Time']], index=df.index)
dt_series = pd.to_datetime(dt_series)
dt_series

0      2004-03-10 18:00:00
1      2004-03-10 19:00:00
2      2004-03-10 20:00:00
3      2004-03-10 21:00:00
4      2004-03-10 22:00:00
               ...
9352   2005-04-04 10:00:00
9353   2005-04-04 11:00:00
9354   2005-04-04 12:00:00
9355   2005-04-04 13:00:00
9356   2005-04-04 14:00:00
Length: 9357, dtype: datetime64[ns]

In [ ]:
#  Get the first 'datetime' value from the 'df_series' and store it in the 'timestamp_0' variable. Print its value.
timestamp_0 = dt_series[0]
timestamp_0

Timestamp('2004-03-10 18:00:00')

In [ ]:
#  Get date from the timestamp stored in the 'timestamp_0' variable. Store the output in the 'date_0' variable.
# Print the value and its data-type.
date_0 = timestamp_0.date()
print(f"Date = {date_0} \nData-Type = {type(date_0)}")

Date = 2004-03-10
Data-Type = <class 'datetime.date'>

In [ ]:
#  Get the day, month and year attributes from the date stored in the 'date_0' variable. Print the attributes and their data-types.
day = date_0.day
month = date_0.month
year = date_0.year
print(f"Day = {day}, Data-Type = {type(day)} \nMonth = {month}, Data-Type = {type(month)} \nYear = {year}, Data-Type = {type(year)}")

Day = 10, Data-Type = <class 'int'>
Month = 3, Data-Type = <class 'int'>
Year = 2004, Data-Type = <class 'int'>

In [ ]:
#  Format the date stored in the 'date_0' variable in the '10-Mar-2004' format. Print newly formatted date and also its data-type.
str_date_0 = date_0.strftime('%d-%b-%Y') #
print(f"Date = {str_date_0} \nData-Type = {type(str_date_0)}")

Date = 10-Mar-2004
Data-Type = <class 'str'>

In [ ]:
# Format the date stored in the 'date_0' variable in the 'March 10, 2004' format. Print newly formatted date and also its data-type.
str_date_0 = date_0.strftime('%B %d, %Y')
print(f"Date = {str_date_0} \nData-Type = {type(str_date_0)}")

Date = March 10, 2004
Data-Type = <class 'str'>

In [ ]:
#  Get the time from the timestamp stored in the 'timestamp_0' variable. Store the output in the 'time_0' variable.
time_0 = timestamp_0.time()
print(f"Time = {time_0} \nData-Type = {type(time_0)}")

Time = 18:00:00
Data-Type = <class 'datetime.time'>

In [ ]:
# Get the hour, minute and second attributes from the time stored in the 'time_0' variable. Print the attributes and their data-types.
hour = time_0.hour
minute = time_0.minute
second = time_0.second
print(f"Hour = {hour}, Data-Type = {type(hour)} \nMinute = {minute}, Data-Type = {type(minute)} \nSecond = {second}, Data-Type = {type(second)}")

Hour = 18, Data-Type = <class 'int'>
Minute = 0, Data-Type = <class 'int'>
Second = 0, Data-Type = <class 'int'>